---
title: DirectShapeTypeOptions
classe: Autodesk.Revit.DB.DirectShapeTypeOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# DirectShapeTypeOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean AllowDuplicateNames { get; set; }` | `directShapeTypeOptions.AllowDuplicateNames` | Boolean |
| `Boolean IsValidObject { get; }` | `directShapeTypeOptions.IsValidObject` | Boolean |
| `Void Dispose()` | `directShapeTypeOptions.Dispose()` | Void |
| `Boolean IsEqualTo(DirectShapeTypeOptions)` | `directShapeTypeOptions.IsEqualTo(other)` | Boolean |
| `Boolean IsValid()` | `directShapeTypeOptions.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```